


0801025C B500     push    r14                                     
0801025E 4806     ldr     r0,=3001530h                            
08010260 88C1     ldrh    r1,[r0,6h]     ;当前血量                           
08010262 8802     ldrh    r2,[r0]        ;最大血量                         
08010264 1C03     mov     r3,r0                                   
08010266 4291     cmp     r1,r2                                   
08010268 D216     bcs     @@HpMax                                
0801026A 1A50     sub     r0,r2,r1                                
0801026C 0400     lsl     r0,r0,10h                               
0801026E 0D41     lsr     r1,r0,15h      ;受伤值除以32                          
08010270 2900     cmp     r1,0h                                   
08010272 D103     bne     @@MoreThan20h                                
08010274 2101     mov     r1,1h                                   
08010276 E004     b       @@Peer                                

@@MoreThan20h:                              
0801027C 290A     cmp     r1,0Ah                                  
0801027E D900     bls     @@Peer        ;伤害小于或等于320                        
08010280 210B     mov     r1,0Bh        ;否则给予Bh

@@Peer:                                 
08010282 88D8     ldrh    r0,[r3,6h]    ;读取当前血量                          
08010284 1808     add     r0,r1,r0      ;加上伤害值除以32                          
08010286 80D8     strh    r0,[r3,6h]    ;再写入                          
08010288 8819     ldrh    r1,[r3]                                 
0801028A 0400     lsl     r0,r0,10h                               
0801028C 0C00     lsr     r0,r0,10h                               
0801028E 4288     cmp     r0,r1         ;当前血量比最大血量                          
08010290 D900     bls     @@pass        ;小于等于                          
08010292 80D9     strh    r1,[r3,6h]    ;如果大于则写入最大血量

@@pass:                              
08010294 2001     mov     r0,1h                                   
08010296 E000     b       @@end 

@@HpMax:                               
08010298 2000     mov     r0,0h 

@@end:                                  
0801029A BC02     pop     r1                                      
0801029C 4708     bx      r1 

                                                                    
080102A0 B500     push    r14                                     
080102A2 4806     ldr     r0,=3001530h                            
080102A4 8901     ldrh    r1,[r0,8h]                              
080102A6 8842     ldrh    r2,[r0,2h]                              
080102A8 1C03     mov     r3,r0                                   
080102AA 4291     cmp     r1,r2                                   
080102AC D216     bcs     80102DCh                                
080102AE 1A50     sub     r0,r2,r1                                
080102B0 0400     lsl     r0,r0,10h                               
080102B2 0D41     lsr     r1,r0,15h                               
080102B4 2900     cmp     r1,0h                                   
080102B6 D103     bne     80102C0h                                
080102B8 2101     mov     r1,1h                                   
080102BA E004     b       80102C6h                                
080102BC 1530     asr     r0,r6,14h                               
080102BE 0300     lsl     r0,r0,0Ch                               
080102C0 2905     cmp     r1,5h                                   
080102C2 D900     bls     80102C6h                                
080102C4 2106     mov     r1,6h                                   
080102C6 8918     ldrh    r0,[r3,8h]                              
080102C8 1808     add     r0,r1,r0                                
080102CA 8118     strh    r0,[r3,8h]                              
080102CC 8859     ldrh    r1,[r3,2h]                              
080102CE 0400     lsl     r0,r0,10h                               
080102D0 0C00     lsr     r0,r0,10h                               
080102D2 4288     cmp     r0,r1                                   
080102D4 D900     bls     80102D8h                                
080102D6 8119     strh    r1,[r3,8h]                              
080102D8 2001     mov     r0,1h                                   
080102DA E000     b       80102DEh                                
080102DC 2000     mov     r0,0h                                   
080102DE BC02     pop     r1                                      
080102E0 4708     bx      r1                                      
080102E2 0000     lsl     r0,r0,0h                                
080102E4 B500     push    r14                                     
080102E6 4806     ldr     r0,=3001530h                            
080102E8 7A81     ldrb    r1,[r0,0Ah]                             
080102EA 7902     ldrb    r2,[r0,4h]                              
080102EC 1C03     mov     r3,r0                                   
080102EE 4291     cmp     r1,r2                                   
080102F0 D216     bcs     8010320h                                
080102F2 1A50     sub     r0,r2,r1                                
080102F4 0400     lsl     r0,r0,10h                               
080102F6 0D01     lsr     r1,r0,14h                               
080102F8 2900     cmp     r1,0h                                   
080102FA D103     bne     8010304h                                
080102FC 2101     mov     r1,1h                                   
080102FE E004     b       801030Ah                                
08010300 1530     asr     r0,r6,14h                               
08010302 0300     lsl     r0,r0,0Ch                               
08010304 2903     cmp     r1,3h                                   
08010306 D900     bls     801030Ah                                
08010308 2104     mov     r1,4h                                   
0801030A 7A98     ldrb    r0,[r3,0Ah]                             
0801030C 1840     add     r0,r0,r1                                
0801030E 7298     strb    r0,[r3,0Ah]                             
08010310 7919     ldrb    r1,[r3,4h]                              
08010312 0600     lsl     r0,r0,18h                               
08010314 0E00     lsr     r0,r0,18h                               
08010316 4288     cmp     r0,r1                                   
08010318 D900     bls     801031Ch                                
0801031A 7299     strb    r1,[r3,0Ah]                             
0801031C 2001     mov     r0,1h                                   
0801031E E000     b       8010322h                                
08010320 2000     mov     r0,0h                                   
08010322 BC02     pop     r1                                      
08010324 4708     bx      r1                                      
08010326 0000     lsl     r0,r0,0h                                
08010328 B500     push    r14                                     
0801032A 4806     ldr     r0,=3001530h                            
0801032C 7AC1     ldrb    r1,[r0,0Bh]                             
0801032E 7942     ldrb    r2,[r0,5h]                              
08010330 1C03     mov     r3,r0                                   
08010332 4291     cmp     r1,r2                                   
08010334 D216     bcs     8010364h                                
08010336 1A50     sub     r0,r2,r1                                
08010338 0400     lsl     r0,r0,10h                               
0801033A 0D01     lsr     r1,r0,14h                               
0801033C 2900     cmp     r1,0h                                   
0801033E D103     bne     8010348h                                
08010340 2101     mov     r1,1h                                   
08010342 E004     b       801034Eh                                
08010344 1530     asr     r0,r6,14h                               
08010346 0300     lsl     r0,r0,0Ch                               
08010348 2903     cmp     r1,3h                                   
0801034A D900     bls     801034Eh                                
0801034C 2104     mov     r1,4h                                   
0801034E 7AD8     ldrb    r0,[r3,0Bh]                             
08010350 1840     add     r0,r0,r1                                
08010352 72D8     strb    r0,[r3,0Bh]                             
08010354 7959     ldrb    r1,[r3,5h]                              
08010356 0600     lsl     r0,r0,18h                               
08010358 0E00     lsr     r0,r0,18h                               
0801035A 4288     cmp     r0,r1                                   
0801035C D900     bls     8010360h                                
0801035E 72D9     strb    r1,[r3,0Bh]                             
08010360 2001     mov     r0,1h                                   
08010362 E000     b       8010366h                                
08010364 2000     mov     r0,0h                                   
08010366 BC02     pop     r1                                      
08010368 4708     bx      r1                                      
0801036A 0000     lsl     r0,r0,0h                                
0801036C B500     push    r14                                     
0801036E 4805     ldr     r0,=30013D4h                            
08010370 7800     ldrb    r0,[r0]                                 
08010372 3804     sub     r0,4h                                   
08010374 2838     cmp     r0,38h                                  
08010376 D900     bls     801037Ah                                
08010378 E07C     b       8010474h                                
0801037A 0080     lsl     r0,r0,2h                                
0801037C 4902     ldr     r1,=801038Ch                            
0801037E 1840     add     r0,r0,r1                                
08010380 6800     ldr     r0,[r0]                                 
08010382 4687     mov     r15,r0                                  
08010384 13D4     asr     r4,r2,0Fh                               
08010386 0300     lsl     r0,r0,0Ch                               
08010388 038C     lsl     r4,r1,0Eh                               
0801038A 0801     lsr     r1,r0,20h                               
0801038C 0470     lsl     r0,r6,11h                               
0801038E 0801     lsr     r1,r0,20h                               
08010390 0470     lsl     r0,r6,11h                               
08010392 0801     lsr     r1,r0,20h                               
08010394 0470     lsl     r0,r6,11h                               
08010396 0801     lsr     r1,r0,20h                               
08010398 0474     lsl     r4,r6,11h                               
0801039A 0801     lsr     r1,r0,20h                               
0801039C 0474     lsl     r4,r6,11h                               
0801039E 0801     lsr     r1,r0,20h                               
080103A0 0474     lsl     r4,r6,11h                               
080103A2 0801     lsr     r1,r0,20h                               
080103A4 0474     lsl     r4,r6,11h                               
080103A6 0801     lsr     r1,r0,20h                               
080103A8 0474     lsl     r4,r6,11h                               
080103AA 0801     lsr     r1,r0,20h                               
080103AC 0474     lsl     r4,r6,11h                               
080103AE 0801     lsr     r1,r0,20h                               
080103B0 0474     lsl     r4,r6,11h                               
080103B2 0801     lsr     r1,r0,20h                               
080103B4 0474     lsl     r4,r6,11h                               
080103B6 0801     lsr     r1,r0,20h                               
080103B8 0474     lsl     r4,r6,11h                               
080103BA 0801     lsr     r1,r0,20h                               
080103BC 0470     lsl     r0,r6,11h                               
080103BE 0801     lsr     r1,r0,20h                               
080103C0 0470     lsl     r0,r6,11h                               
080103C2 0801     lsr     r1,r0,20h                               
080103C4 0470     lsl     r0,r6,11h                               
080103C6 0801     lsr     r1,r0,20h                               
080103C8 0470     lsl     r0,r6,11h                               
080103CA 0801     lsr     r1,r0,20h                               
080103CC 0470     lsl     r0,r6,11h                               
080103CE 0801     lsr     r1,r0,20h                               
080103D0 0474     lsl     r4,r6,11h                               
080103D2 0801     lsr     r1,r0,20h                               
080103D4 0474     lsl     r4,r6,11h                               
080103D6 0801     lsr     r1,r0,20h                               
080103D8 0474     lsl     r4,r6,11h                               
080103DA 0801     lsr     r1,r0,20h                               
080103DC 0474     lsl     r4,r6,11h                               
080103DE 0801     lsr     r1,r0,20h                               
080103E0 0474     lsl     r4,r6,11h                               
080103E2 0801     lsr     r1,r0,20h                               
080103E4 0474     lsl     r4,r6,11h                               
080103E6 0801     lsr     r1,r0,20h                               
080103E8 0474     lsl     r4,r6,11h                               
080103EA 0801     lsr     r1,r0,20h                               
080103EC 0474     lsl     r4,r6,11h                               
080103EE 0801     lsr     r1,r0,20h                               
080103F0 0474     lsl     r4,r6,11h                               
080103F2 0801     lsr     r1,r0,20h                               
080103F4 0474     lsl     r4,r6,11h                               
080103F6 0801     lsr     r1,r0,20h                               
080103F8 0474     lsl     r4,r6,11h                               
080103FA 0801     lsr     r1,r0,20h                               
080103FC 0474     lsl     r4,r6,11h                               
080103FE 0801     lsr     r1,r0,20h                               
08010400 0474     lsl     r4,r6,11h                               
08010402 0801     lsr     r1,r0,20h                               
08010404 0474     lsl     r4,r6,11h                               
08010406 0801     lsr     r1,r0,20h                               
08010408 0474     lsl     r4,r6,11h                               
0801040A 0801     lsr     r1,r0,20h                               
0801040C 0474     lsl     r4,r6,11h                               
0801040E 0801     lsr     r1,r0,20h                               
08010410 0474     lsl     r4,r6,11h                               
08010412 0801     lsr     r1,r0,20h                               
08010414 0474     lsl     r4,r6,11h                               
08010416 0801     lsr     r1,r0,20h                               
08010418 0474     lsl     r4,r6,11h                               
0801041A 0801     lsr     r1,r0,20h                               
0801041C 0474     lsl     r4,r6,11h                               
0801041E 0801     lsr     r1,r0,20h                               
08010420 0474     lsl     r4,r6,11h                               
08010422 0801     lsr     r1,r0,20h                               
08010424 0474     lsl     r4,r6,11h                               
08010426 0801     lsr     r1,r0,20h                               
08010428 0474     lsl     r4,r6,11h                               
0801042A 0801     lsr     r1,r0,20h                               
0801042C 0474     lsl     r4,r6,11h                               
0801042E 0801     lsr     r1,r0,20h                               
08010430 0474     lsl     r4,r6,11h                               
08010432 0801     lsr     r1,r0,20h                               
08010434 0474     lsl     r4,r6,11h                               
08010436 0801     lsr     r1,r0,20h                               
08010438 0474     lsl     r4,r6,11h                               
0801043A 0801     lsr     r1,r0,20h                               
0801043C 0474     lsl     r4,r6,11h                               
0801043E 0801     lsr     r1,r0,20h                               
08010440 0470     lsl     r0,r6,11h                               
08010442 0801     lsr     r1,r0,20h                               
08010444 0474     lsl     r4,r6,11h                               
08010446 0801     lsr     r1,r0,20h                               
08010448 0474     lsl     r4,r6,11h                               
0801044A 0801     lsr     r1,r0,20h                               
0801044C 0470     lsl     r0,r6,11h                               
0801044E 0801     lsr     r1,r0,20h                               
08010450 0470     lsl     r0,r6,11h                               
08010452 0801     lsr     r1,r0,20h                               
08010454 0470     lsl     r0,r6,11h                               
08010456 0801     lsr     r1,r0,20h                               
08010458 0470     lsl     r0,r6,11h                               
0801045A 0801     lsr     r1,r0,20h                               

