08012818 B500     push    lr
0801281A 4A0E     ldr     r2,=30006BCh
0801281C 1C10     mov     r0,r2
0801281E 3024     add     r0,24h
08012820 7800     ldrb    r0,[r0]		;读取pose
08012822 2800     cmp     r0,0h
08012824 D113     bne     @@end		;不是0则结束
08012826 1C10     mov     r0,r2
08012828 302A     add     r0,2Ah		
0801282A 7803     ldrb    r3,[r0]		;精灵slot???
0801282C 8811     ldrh    r1,[r2]
0801282E 2080     mov     r0,80h
08012830 0180     lsl     r0,r0,6h
08012832 4008     and     r0,r1
08012834 2800     cmp     r0,0h			;检查取向是否有2000
08012836 D105     bne     @@have2000	
08012838 1C18     mov     r0,r3
0801283A 3810     sub     r0,10h		;精灵slot减10??
0801283C 0600     lsl     r0,r0,18h
0801283E 0E00     lsr     r0,r0,18h
08012840 280F     cmp     r0,0Fh		;检查是否大于0F
08012842 D804     bhi     @@end			;大于则结束

@@have2000:
08012844 3234     add     r2,34h
08012846 7811     ldrb    r1,[r2]
08012848 2002     mov     r0,2h
0801284A 4308     orr     r0,r1
0801284C 7010     strb    r0,[r2]		;碰撞判定orr2

@@end:
0801284E BC01     pop     r0
08012850 4700     bx      r0